#Зададча №1.1

"""a = int(input("Введите число от 1 до 10: "))
if  a<=3:
    print("Плохо")
elif a<=6:
    print("Удовлетворительно")
elif a<=9:
    print("Хорошо")
else:
    print("Отлично")"""

#Зададча №1.2

"""a = int(input("Введите время суток от 0 до 24: "))
if  a>=6 and a<=12:
    print("Доброе утро")
elif a>=12 and a<=18:
    print("Добрый день")
elif a>=18 and a<=24:
    print("Добрый вечер")
elif a>=0 and a<=6:
    print("Спокойной ночи")
else:
    print("Попробуйте ввести заново")"""

#Задача №2.1
'''a = int(input("Введите число: "))
for b in range(1,a,1):
    if b%3==0:
        print(b,end=",")'''

#Задача №2.2
'''numbers = [1,2,-5,3,-4,5,4]
countTrueNumbers = 0
trueNumber = 1
sumOfNumber = 0
for number in numbers:
    if number >= trueNumber:
        countTrueNumbers +=1
        sumOfNumber += number
        total = sumOfNumber // countTrueNumbers
print(total)'''

#Задание ***

'''a = "*"
for i in range(1,6):
    print(" "*(6-i),a*i*2)'''


#Остальные задачи со звездочками еще не сделал!!!
  