#Задание № 1

"""kino = {
    "comedy":{
        1:"Эйс Вентура",
        2:"Маска"
        },
    
    "action":{
        1:"Терминатор",
        2:"Рэмбо"

        },
    
    "horror":{
        1:"Пила",
        2:"Крик"
        } 
} 
kino["comedy"][3]="Друзья"
kino["action"][3]="Робокоп"
kino["horror"][3]="Астрал"
print(kino)"""


#Задание № 2
#Не могу понять как делать

students ={
    "Nina":{
        "Математика":[84],
        "Биология":[70],
        "Физика":[55]}}

sr_ocenka = 0
for i in students:
    sr_ocenka+=sum(i)
    print(sr_ocenka)
    



#Задание № 3
"""matrix = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
a=0
b=0
for i in matrix:
    a+=sum(i)
b=a//len(matrix)
print(a)
print(b)
    """

#Задание № 4

"""autors = {
    "Пушкин": {
        "Капитаскя дочка":"bluibljkblhbljkblkjbu",
        "Евгений Онегин":"ljjkbnkj.jk;kn;"
    },

    "Кунанбаев":{
        "Слова назидания":"11111112333333333333",
        "Книга Мудрости":"7777777778888888888888899"
    }
}
poisk = input("Введите автора:")
for items in autors:
    if poisk in items:
        print(autors[poisk])"""
    
